import { Box, Container, Typography } from "@material-ui/core";
import React, { useState } from "react";
import { useStyles } from "./styles";
import { ISets } from "../../Interfaces/interfaces";
import SetCard from "./SetCard/index.tsx";

const Sets = () => {
    const [sets] = useState<ISets[]>([
        {
            img: 'https://pizza.od.ua/upload/resize_cache/iblock/0e3/640_400_1/0e39d89f88d5ef7125d416842ba9e46c.jpg',
            name: 'Папперони + Калифорния',
            id: 14,
            desc: 'Оновлена акційна пропозиція саме для тебе! Розкачай свою знижку! Замовляй ДВІ піци та отримуй -20% знижки на 2-гу піцу! Замовляй ТРИ піци та отримуй -20% знижки на 2-гу піцу та -25% на 3-тю! Замовляй ЧОТИРИ піци та отримуй -20% на 2-гу піцу, -25% на 3-тю та -30% на 4-ту! Акція діє щодня. Акція розповсюджується на ВСІ середні та великі піци! Акція діє при замовленні на доставку, у піцерії та з собою. Знижка надається на менший за ціною товар у чеку. Акція діє на необмежену кількість піц у чеку. Акція не сумується з іншими акційними пропозиціями. Умови програми лояльності «Domino’s club» розповсюджуються на акційну пропозицію.',
        },
        {
            img: 'https://allolosos.com.ua/i/products/thumb-62003fb343152.jpg',
            name: 'Cola + Пиццы (25см)',
            id: 15,
            desc: 'Оновлена акційна пропозиція саме для тебе! Розкачай свою знижку! Замовляй ДВІ піци та отримуй -20% знижки на 2-гу піцу! Замовляй ТРИ піци та отримуй -20% знижки на 2-гу піцу та -25% на 3-тю! Замовляй ЧОТИРИ піци та отримуй -20% на 2-гу піцу, -25% на 3-тю та -30% на 4-ту! Акція діє щодня. Акція розповсюджується на ВСІ середні та великі піци! Акція діє при замовленні на доставку, у піцерії та з собою. Знижка надається на менший за ціною товар у чеку. Акція діє на необмежену кількість піц у чеку. Акція не сумується з іншими акційними пропозиціями. Умови програми лояльності «Domino’s club» розповсюджуються на акційну пропозицію.',
        },
        {
            img: 'https://allolosos.com.ua/i/products/thumb-62003fb343152.jpg',
            name: 'Cola + Пиццы (25см)',
            id: 15,
            desc: 'Оновлена акційна пропозиція саме для тебе! Розкачай свою знижку! Замовляй ДВІ піци та отримуй -20% знижки на 2-гу піцу! Замовляй ТРИ піци та отримуй -20% знижки на 2-гу піцу та -25% на 3-тю! Замовляй ЧОТИРИ піци та отримуй -20% на 2-гу піцу, -25% на 3-тю та -30% на 4-ту! Акція діє щодня. Акція розповсюджується на ВСІ середні та великі піци! Акція діє при замовленні на доставку, у піцерії та з собою. Знижка надається на менший за ціною товар у чеку. Акція діє на необмежену кількість піц у чеку. Акція не сумується з іншими акційними пропозиціями. Умови програми лояльності «Domino’s club» розповсюджуються на акційну пропозицію.',
        },
        {
            img: 'https://allolosos.com.ua/i/products/thumb-62003fb343152.jpg',
            name: 'Cola + Пиццы (25см)',
            id: 15,
            desc: 'Оновлена акційна пропозиція саме для тебе! Розкачай свою знижку! Замовляй ДВІ піци та отримуй -20% знижки на 2-гу піцу! Замовляй ТРИ піци та отримуй -20% знижки на 2-гу піцу та -25% на 3-тю! Замовляй ЧОТИРИ піци та отримуй -20% на 2-гу піцу, -25% на 3-тю та -30% на 4-ту! Акція діє щодня. Акція розповсюджується на ВСІ середні та великі піци! Акція діє при замовленні на доставку, у піцерії та з собою. Знижка надається на менший за ціною товар у чеку. Акція діє на необмежену кількість піц у чеку. Акція не сумується з іншими акційними пропозиціями. Умови програми лояльності «Domino’s club» розповсюджуються на акційну пропозицію.',
        },
    ])
    const classes = useStyles()
    return (
        <Box>
            <Typography component='h2' className={classes.page_head}>Наборы</Typography>
            <Container className={classes.sets_cont}>
                {sets.map((item) => <SetCard img={item.img} desc={item.desc} key={item.id} />)}
            </Container>
        </Box>
    )
}
export default Sets